In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import re

In [2]:
engine = create_engine("postgresql://postgres:postgres@localhost:5432/hr_db")

In [3]:
df = pd.read_csv('human_resources_dataset.csv', parse_dates=['START_DT', 'END_DT'])
df.columns = ['employee_id',
             'employee_name',
             'employee_email',
             'hire_date',
             'job',
             'salary',
             'department',
             'manager',
             'start_date',
             'end_date',
             'location',
             'address',
             'city',
             'state',
             'education']
df['salary'] = df['salary'].str.replace(',', '').astype('int')
df['start_date'] = df['start_date'].dt.date
df['end_date'] = df['end_date'].dt.date
df.head()

,employee_id,employee_name,employee_email,hire_date,job,salary,department,manager,start_date,end_date,location,address,city,state,education
0,E17469,Haifa Hajiri,Haifa.Hajiri@TechCorp.com,2003-12-17,Administrative Assistant,47418,Distribution,Allison Gentle,2003-12-17,NaT,West Coast,705 James Way,San Francisco,CA,No College
1,E27621,Wendell Mobley,Wendell.Mobley@TechCorp.com,2013-11-27,Administrative Assistant,28969,Distribution,Allison Gentle,2013-11-27,NaT,West Coast,705 James Way,San Francisco,CA,Some College
2,E27909,Michael Sperduti,Michael.Sperduti@TechCorp.com,2014-06-20,Administrative Assistant,43778,Distribution,Allison Gentle,2014-06-20,NaT,West Coast,705 James Way,San Francisco,CA,Associates Degree
3,E35053,Ashley Bergman,Ashley.Bergman@TechCorp.com,2009-03-01,Administrative Assistant,41090,Distribution,Allison Gentle,2009-03-01,NaT,Midwest,1300 Nicollet Mall,Minnapolis,MN,No College
4,E51723,Carlos Lopez,Carlos.Lopez@TechCorp.com,2014-05-23,Administrative Assistant,35825,Distribution,Allison Gentle,2014-05-23,NaT,East Coast,165 Broadway,New York City,NY,No College

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   employee_id     205 non-null    object
 1   employee_name   205 non-null    object
 2   employee_email  205 non-null    object
 3   hire_date       205 non-null    object
 4   job             205 non-null    object
 5   salary          205 non-null    int64
 6   department      205 non-null    object
 7   manager         204 non-null    object
 8   start_date      205 non-null    object
 9   end_date        6 non-null      object
 10  location        205 non-null    object
 11  address         205 non-null    object
 12  city            205 non-null    object
 13  state           205 non-null    object
 14  education       205 non-null    object
dtypes: int64(1), object(14)
memory usage: 24.1+ KB

In [5]:
for col in df.columns:
    print(col, df[col].nunique())

employee_id 199
employee_name 199
employee_email 199
hire_date 199
job 10
salary 205
department 5
manager 5
start_date 205
end_date 6
location 5
address 5
city 5
state 5
education 7

In [6]:
df_dict = {}
for col in ['job', 'salary', 'department', 'location', 'education']:
    table_df = df[[col]]\
                .drop_duplicates()\
                .sort_values(col)\
                .reset_index()\
                .drop('index', axis=1)\
                .reset_index()
    table_df.columns = [col+"_id", col]
    df_dict[col] = table_df
    table_df.to_sql(col, engine, index=False)

In [7]:
employee = df[['employee_id', 'employee_name', 'employee_email']]\
            .drop_duplicates()\
            .sort_values('employee_id')\
            .reset_index()\
            .drop('index', axis=1)\
            .reset_index()
employee.columns = ['id', 'employee_id', 'employee_name', 'employee_email']
df_dict['employee'] = employee
employee.to_sql('employee', engine, index=False)
employee.head()

   id employee_id    employee_name                employee_email
0   0      E10033  Jermaine Massey  Jermaine.Massey@TechCorp.com
1   1      E10407   Darshan Rathod   Darshan.Rathod@TechCorp.com
2   2      E11678     Colleen Alma     Colleen.Alma@TechCorp.com
3   3      E11920   Sharon Gillies   Sharon.Gillies@TechCorp.com
4   4      E12397  Daniel Matkovic  Daniel.Matkovic@TechCorp.com

In [8]:
address = df[['address', 'city', 'state', 'location']]\
            .drop_duplicates()\
            .sort_values(['state', 'city', 'address'])\
            .reset_index()\
            .drop('index', axis=1)\
            .reset_index()
address.columns = ['address_id', 'address', 'city', 'state', 'location']
address = address.merge(df_dict['location'], on='location').drop('location', axis=1)
df_dict['address'] = address
address.to_sql('address', engine, index=False)
address

   address_id              address           city state  location_id
0           0        705 James Way  San Francisco    CA            4
1           1   1300 Nicollet Mall     Minnapolis    MN            2
2           2         165 Broadway  New York City    NY            0
3           3         422 Broadway      Nashville    TN            3
4           4  1 Tech ABC Corp Way         Dallas    TX            1

In [9]:
merge_df = df.drop(['employee_name', 'employee_email', 'hire_date', 'location', 'city', 'state'], axis=1)
for col in ['job', 'salary', 'department', 'education', 'address']:
    merge_df = merge_df.merge(df_dict[col], on=col).drop(col, axis=1)
merge_df.head()

,employee_id,manager,start_date,end_date,job_id,salary_id,department_id,education_id,address_id,city,state,location_id
0,E17469,Allison Gentle,2003-12-17,NaT,0,34,0,5,0,San Francisco,CA,4
1,E53895,Allison Gentle,2014-10-27,NaT,8,4,0,5,0,San Francisco,CA,4
2,E57987,Conner Kinch,2016-05-15,NaT,0,40,3,5,0,San Francisco,CA,4
3,E27621,Allison Gentle,2013-11-27,NaT,0,5,0,6,0,San Francisco,CA,4
4,E59688,Allison Gentle,2006-01-11,NaT,0,14,0,6,0,San Francisco,CA,4

In [10]:
merge_df = merge_df.merge(df_dict['employee'], 
               left_on='manager', 
               right_on='employee_name', 
               how='left', 
               suffixes=[None,'_manager'])
merge_df = merge_df.drop(['manager','city','state','employee_name','employee_email','employee_id_manager'], axis=1)\
                   .rename(columns={'id':'manager_id'})
merge_df['manager_id'] = merge_df['manager_id'].fillna(18).astype(int)

merge_df.head()

,employee_id,start_date,end_date,job_id,salary_id,department_id,education_id,address_id,location_id,manager_id
0,E17469,2003-12-17,NaT,0,34,0,5,0,4,124
1,E53895,2014-10-27,NaT,8,4,0,5,0,4,124
2,E57987,2016-05-15,NaT,0,40,3,5,0,4,149
3,E27621,2013-11-27,NaT,0,5,0,6,0,4,124
4,E59688,2006-01-11,NaT,0,14,0,6,0,4,124

In [11]:
merge_df = merge_df.merge(df_dict['employee'], 
               on='employee_id', 
               how='left', 
               suffixes=[None,'_employee'])
employee_history = merge_df.drop(['employee_id', 'employee_name', 'employee_email'], axis=1)
          
employee_history.head()

,start_date,end_date,job_id,salary_id,department_id,education_id,address_id,location_id,manager_id,id
0,2003-12-17,NaT,0,34,0,5,0,4,124,20
1,2014-10-27,NaT,8,4,0,5,0,4,124,106
2,2016-05-15,NaT,0,40,3,5,0,4,149,114
3,2013-11-27,NaT,0,5,0,6,0,4,124,44
4,2006-01-11,NaT,0,14,0,6,0,4,124,115

In [12]:
df_dict['employee_history'] = employee_history
employee_history = employee_history[['id',
 'manager_id',
 'education_id',
 'job_id',
 'department_id',
 'address_id',
 'salary_id',
 'start_date',
 'end_date']]
df_dict['employee_history'] = employee_history
employee_history.to_sql('employee_history', engine, index=False)
employee_history

,id,manager_id,education_id,job_id,department_id,address_id,salary_id,start_date,end_date
0,20,124,5,0,0,0,34,2003-12-17,NaT
1,106,124,5,8,0,0,4,2014-10-27,NaT
2,114,149,5,0,3,0,40,2016-05-15,NaT
3,44,124,6,0,0,0,5,2013-11-27,NaT
4,115,124,6,0,0,0,14,2006-01-11,NaT
...,...,...,...,...,...,...,...,...,...
200,189,149,3,7,3,4,163,2017-01-09,NaT
201,6,149,3,9,3,4,146,2010-06-06,NaT
202,21,149,3,9,3,4,133,2008-01-27,NaT
203,29,170,3,7,4,4,73,1997-12-08,NaT
204,70,170,3,7,4,4,174,1996-12-08,NaT

In [13]:
l =  ['ID', 'Manager_ID', 'Education_ID', 'Job_ID', 
                                     'Department_ID', 'Address_ID', 'Salary_ID', 'Start_Date', 'End_Date']
[c.lower() for c in l]

['id',
 'manager_id',
 'education_id',
 'job_id',
 'department_id',
 'address_id',
 'salary_id',
 'start_date',
 'end_date']

In [14]:
# remove Hire_DT
# Check Name of the columns
# address table add city and state columns
# salary INT
#ID instead employee_ID